src/soap/MantisConnectBinding.mc_issue_set_tags.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://futureware.biz/mantisconnect">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:mc_issue_set_tags>
   <username></username>
   <password></password>
   <issue_id></issue_id>
   <tags SOAP-ENC:arrayType="ns1:TagData[1]">
    <item>
     <id></id>
     <user_id>
      <id></id>
      <name></name>
      <real_name></real_name>
      <email></email>
     </user_id>
     <name></name>
     <description></description>
     <date_created>2013-06-23T00:32:00Z</date_created>
     <date_updated>2013-06-23T00:32:00Z</date_updated>
    </item>
   
    <item>
     <id></id>
     <user_id>
      <id></id>
      <name></name>
      <real_name></real_name>
      <email></email>
     </user_id>
     <name></name>
     <description></description>
     <date_created>2013-06-23T00:32:00Z</date_created>
     <date_updated>2013-06-23T00:32:00Z</date_updated>
    </item>
   </tags>
  </ns1:mc_issue_set_tags>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
